# -*- coding: utf-8 -*-
import sys
reload(sys)
sys.setdefaultencoding('utf-8')

keywordList = ['大数据','Spanner','hadoop','impala','spark','storm','mahout','zookeeper','Oozie','sqoop','flume','R语言','HTML5','方法','研究','云计算','方法','研究','算法','混合云','移动','移动信息化','移动开发平台','物联网','方法','M2M','企业移动应用平台','企业移动管理','MDM','MAM','MCM','移动云服务','企业移动应用商店','安全','数据安全','云计算安全','通讯安全','服务器安全','权限','身份管理','设备管理','SOA','企业集成','ESB','iPaaS','应用集成','主数据','MDM','身份管理','IdM','ROA','IT系统现代化','流程集成','数据集成','门户集成','软件定义IT','商业分析','商业智能','数据挖掘','数据可视化','深度学习','数据挖掘算法','分布式数据挖掘','分析模型','数据采集','电商','电商运营','京东','天猫','拍拍','社交网络','社交挖掘','社交数据','社交插件','社媒监听','社交集成','IM','微信','微博','sap','甲骨文','oracle','ibm','金蝶','阿里','阿里巴巴','Alibaba','马云','腾讯','Tencent','马化腾','浪潮','百度','baidu','李彦宏','Vmware','普元','primeton','用友iUAP','AE','用友BQ','UDH','谢东','谢志华','用友','用友NC','用友U8','用友U9','用友HCM','HADOOP','开源','JAVA','数据挖掘','商业分析','开源','CIO','俱乐部','IT规划','实施方法论','章培林','刘剑锋','NC6','用友电商','会商云','用友杜宇','微联','友联','电商通','友客通','用友移动','嘟嘟','企业＋','移动CRM','协同办公','优普移动']
keywordList = set(keywordList)

for w in sorted(set(keywordList)):
  print w

print 'num:',len(keywordList)
